---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TypeBinding Properties
TypeBinding Class See Also Send Feedback
---

The TypeBinding type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieve or set the categories to which a parameter definition will be bound. (Inherited from ElementBinding.) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

TypeBinding Class

Autodesk.Revit.DB Namespace